# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash'
brew 'coreutils'
brew 'direnv'
brew 'gh'
brew 'git'
# brew 'go'
brew 'grep'
# brew 'helm'
# brew 'helmfile'
brew 'hub'
# brew 'mas'
brew 'nvm'
brew 'pkg-config'
# brew 'pre-commit'
# brew 'terraform'
brew 'thefuck'
brew 'trash'
brew 'tree'

# Development
# brew 'composer'
# brew 'php'
# brew 'php@7.4'
# brew 'php@7.3'

# Apps
cask '1password'
cask '1password-cli'
#cask 'alfred'
cask 'aws-vault'
# cask 'discord'
# cask 'docker'
cask 'firefox'
cask 'github'
# cask 'goland'
# cask 'intellij-idea-ce'
cask 'iterm2'
# cask 'phpstorm'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'webstorm'
cask 'whatsapp'
