# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash'
brew 'coreutils'
brew 'direnv'
brew 'gh'
brew 'git'
# brew 'go'
brew 'grep'
# brew 'helm'
# brew 'helmfile'
brew 'hub'
# brew 'mas'
brew 'nvm'
brew 'pkg-config'
brew 'pyenv'
# brew 'pre-commit'
brew 'protobuf'
# brew 'terraform'
brew 'thefuck'
brew 'trash'
brew 'tree'
brew 'Noovolari/brew/leapp-cli-darwin-arm64'

# Development
# brew 'composer'
# brew 'php'
# brew 'php@8.0'

# Apps
cask 'android-studio'
cask '1password'
# cask '1password-cli'
# cask 'alfred'
cask 'aws-vault'
# cask 'chromium'
# cask 'discord'
# cask 'docker'
cask 'firefox'
# cask 'flutter'
cask 'github'
cask 'google-chrome'
# cask 'goland'
# cask 'intellij-idea-ce'
# cask 'iterm2'
# cask 'phpstorm'
cask 'pycharm-ce'
cask 'rectangle'
cask 'slack'
# cask 'leapp'
# cask 'spectacle'
cask 'spotify'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'warp'
cask 'webstorm'
# cask 'whatsapp'
# cask 'zoom'
